# TextStyleItalic Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TextStyleItalic Property
ParameterTypeId Class See Also
---
"Italic"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TextStyleItalic { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TextStyleItalic As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TextStyleItalic {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace